---
kind: type
id: T:Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType

Types of issues encountered while constructing geometrical objects
 from the tessellatted face sets.

## Syntax (C#)
```csharp
public enum TessellatedBuildIssueType
```